vlm/extension/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_СрокСдачиЗаказчику</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ДатаРасчетаСрокаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ОбщийСрокИзготовленияЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_СрокИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>бит_ДатаИзготовления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаОтгрузки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Enums/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРазработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Enums/СтатусыЭтаповПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЭтаповПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/ЗаказКлиента/Forms/бит_ФормаРасчетаСрокаИзготовления/Ext/Form/Module.bsl
&НаКлиенте
Перем ФормаДлительнойОперации;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для каждого стр из Объект.Товары Цикл
		Если стр.Отменено Тогда
			Продолжить;
		КонецЕсли;
		нов = ТаблицаТоваров.Добавить();    
		ЗаполнитьЗначенияСвойств(нов, стр, "НомерСтроки,Номенклатура,Количество");
		нов.Спецификация = ОпределитьПоследнююСпецификацию(нов.Номенклатура, ТекущаяДатаСеанса()); 
		нов.СрокИзготовления = ПустойСрок();
	КонецЦикла;
	СрокИзготовленияЗаказа = Дата("00010101");     
	Элементы.Ошибки.Видимость = Ошибки.Количество();
	ДинамическаяСтруктура = Истина;
	
	ЗаполнитьДлительныеОперацииФормы();
	
КонецПроцедуры                               

#Область Вспомогалки

&НаКлиентеНаСервереБезКонтекста
Функция ПустойСрок()
	Возврат "Не определён";
КонецФункции

&НаСервере
Процедура ЗаполнитьДлительныеОперацииФормы()
	
	НоваяСтрока = ДлительныеОперацииФормы.Добавить();
	НоваяСтрока.Имя = ИмяДлительнойОперацииСрокиВыпуска();
	НоваяСтрока.НачатьОжидание = Ложь;
	НоваяСтрока.ДлительнаяОперация = Неопределено;
	
	НоваяСтрока = ДлительныеОперацииФормы.Добавить();
	НоваяСтрока.Имя = ИмяДлительнойОперацииЗагрузкаОборудования();
	НоваяСтрока.НачатьОжидание = Ложь;
	НоваяСтрока.ДлительнаяОперация = Неопределено;
	
	НоваяСтрока = ДлительныеОперацииФормы.Добавить();
	НоваяСтрока.Имя = ИмяДлительнойОперацииОбеспечениеМатериалами();
	НоваяСтрока.НачатьОжидание = Ложь;
	НоваяСтрока.ДлительнаяОперация = Неопределено;
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ОпределитьПоследнююСпецификацию(Номенклатура, ДатаРасчета)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	РесурсныеСпецификации.НачалоДействия КАК НачалоДействия,
		|	РесурсныеСпецификации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
		|ГДЕ
		|	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура = &ОсновноеИзделиеНоменклатура
		|	И РесурсныеСпецификации.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
		|	И НЕ РесурсныеСпецификации.ПометкаУдаления
		|	И РесурсныеСпецификации.НачалоДействия <= &ДатаРасчета
	//	|	И РесурсныеСпецификации.КонецДействия >= &ДатаРасчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	НачалоДействия УБЫВ
		|");	
	Запрос.УстановитьПараметр("ОсновноеИзделиеНоменклатура", Номенклатура);
	Запрос.УстановитьПараметр("ДатаРасчета", ДатаРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Спецификация = Выборка.Ссылка;
	Иначе
		Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Спецификация;
	
КонецФункции          

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)  
	
	сВозврата = Новый Соответствие;
	Для каждого стр из ТаблицаТоваров Цикл
		Если ЗначениеЗаполнено(стр.СрокИзготовления) И ТипЗнч(стр.СрокИзготовления) = Тип("Дата") Тогда
			сВозврата.Вставить(стр.НомерСтроки, стр.СрокИзготовления);
		КонецЕсли;
	КонецЦикла;
	Закрыть(сВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСрокИзготовленияЗаказа(Команда)
	КомандаРассчитатьСрокИзготовления();
КонецПроцедуры                      

&НаКлиенте
Процедура КомандаРассчитатьСрокИзготовления() 
	
	РасчетЗавершен = Ложь;
    СрокИзготовленияЗаказа = Дата("00010101");
	
	Если ЗначениеЗаполнено(ЗаказНаПроизводство) Тогда
		УдалитьЗаказНаПроизводство();
	КонецЕсли;
	Ошибки.Очистить();
	
	Если ВоеннаяПродукция Тогда
		РассчитатьНаСервере(); 
		РассчитатьОбщийСрокИзготовления();  
		Элементы.Ошибки.Видимость = Ошибки.Количество();
	Иначе
		НастройкиПроизводства = Неопределено;
		РассчитатьНаСервере(НастройкиПроизводства); 
	    РасчетЗавершение(НастройкиПроизводства);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура УдалитьЗаказНаПроизводство()

		ДокОбъект = ЗаказНаПроизводство.ПолучитьОбъект();
		ДокОбъект.УстановитьПометкуУдаления(Истина);
		
		// удалим регистратор графика производства
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	ДоступностьВидовРабочихЦентров.Регистратор КАК Ссылка
		                      |ИЗ
		                      |	РегистрНакопления.ДоступностьВидовРабочихЦентров КАК ДоступностьВидовРабочихЦентров
		                      |ГДЕ
		                      |	ДоступностьВидовРабочихЦентров.Распоряжение = &Распоряжение");
		Запрос.УстановитьПараметр("Распоряжение", ДокОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			РегистраторОбъект = Выборка.Ссылка.ПолучитьОбъект();
			РегистраторОбъект.УстановитьПометкуУдаления(Истина);
			РегистраторОбъект = Выборка.Ссылка.ПолучитьОбъект();
			РегистраторОбъект.Удалить(); 
		КонецЦикла;
		// теперь удалим сам заказ на производство
		ДокОбъект = ЗаказНаПроизводство.ПолучитьОбъект();
		ДокОбъект.Удалить();   
		ЗаказНаПроизводство	 = Документы.ЗаказНаПроизводство2_2.ПустаяСсылка();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьОбщийСрокИзготовления()
	
	тСроки = ТаблицаТоваров.Выгрузить( , "СрокИзготовления");
	тСроки.Сортировать("СрокИзготовления убыв");
	СрокИзготовленияЗаказа = тСроки[0].СрокИзготовления;
	Если ВариантОтгрузки = 1 Тогда
		Для каждого стр из ТаблицаТоваров Цикл
			стр.СрокИзготовления = СрокИзготовленияЗаказа;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере(НастройкиПроизводства = Неопределено)  
	
	ДатаРасчета = ТекущаяДатаСеанса();
	// ----------------------------------------------------------
	Если ВоеннаяПродукция Тогда     
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	бит_СрокиИзготовленияВПиРиски.Номенклатура КАК Номенклатура,
		|	бит_СрокиИзготовленияВПиРиски.СрокБазовыйДни + бит_СрокиИзготовленияВПиРиски.РискУвеличенияСрокаДни КАК Срок
		|ИЗ
		|	РегистрСведений.бит_СрокиИзготовленияВПиРиски КАК бит_СрокиИзготовленияВПиРиски
		|ГДЕ
		|	бит_СрокиИзготовленияВПиРиски.Номенклатура В (&мНоменклатура)
		|	И бит_СрокиИзготовленияВПиРиски.ВоеннаяПродукция
		|");
		Запрос.УстановитьПараметр("мНоменклатура", ТаблицаТоваров.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура"));
		Результат = Запрос.Выполнить().Выгрузить();
		Для каждого стр из ТаблицаТоваров Цикл
			СтрокаПоКлючу = Результат.Найти(стр.Номенклатура, "Номенклатура");
			Если СтрокаПоКлючу <> Неопределено Тогда
				стр.СрокИзготовления = НачалоДня(ДатаРасчета) + СтрокаПоКлючу.Срок * 86400;
			КонецЕсли;
		КонецЦикла;
		
	Иначе 
		// Создание заказа на производство
		Результат = Новый Структура("АдресТовары,Основание,Склад");
		СтруктураВозврата = АдресТовары();
		Результат.АдресТовары = СтруктураВозврата.АдресТовары;
		Результат.Основание = Объект.Ссылка;
		Результат.Склад = СтруктураВозврата.ОдинСклад;
		
		Док = Документы.ЗаказНаПроизводство2_2.СоздатьДокумент();
		Док.Заполнить(Результат);
		Док.Дата = ТекущаяДатаСеанса(); 
		Док.Статус = Перечисления.СтатусыЗаказовНаПроизводство2_2.КПроизводству;  
		Для каждого стр из Док.Продукция Цикл
			стр.ДатаПотребности = Док.Дата;
		КонецЦикла;
		
		Док.ДополнительныеСвойства.Вставить("бит_ПредварительныйРасчет", Истина); // чтобы статус заказа клиента не менялся в подписке при проведении заказа на производство
		
		Док.Записать(РежимЗаписиДокумента.Проведение);  
		ЗаказНаПроизводство = Док.Ссылка;   
		Документы.ЗаказНаПроизводство2_2.ПротоколРасчетаСтруктурыЗаказа(ЗаказНаПроизводство);
		// расчет динамического планирования	
		ПлюсПятьСекунд = ТекущаяДатаСеанса() + 20;                      
		Результат = Документы.ЗаказНаПроизводство2_2.ПротоколРасчетаСтруктурыЗаказа(ЗаказНаПроизводство);
		Пока Результат.Состояние <> 1 Или ТекущаяДатаСеанса() <= ПлюсПятьСекунд Цикл
			Результат = Документы.ЗаказНаПроизводство2_2.ПротоколРасчетаСтруктурыЗаказа(ЗаказНаПроизводство);
		КонецЦикла;
		//планировать
		НастройкиПроизводства = Обработки.ПланированиеГрафикаПроизводства2_2.НастройкиПланированияПредварительногоГрафика();
		НастройкиПроизводства.ЗаказНаПроизводство = Док.Ссылка;
		НастройкиПроизводства.ДинамическаяСтруктура = Истина;
		НастройкиПроизводства.ПланироватьГрафик = Истина;

	КонецЕсли;     
	
КонецПроцедуры   

&НаКлиенте
Процедура РасчетЗавершение(НастройкиРасчета, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НЕ НастройкиРасчета = Неопределено Тогда
		
		Результат = ПланироватьГрафикВФоновомРежиме(НастройкиРасчета);
		ЗаполнитьРеквизитыФоновойОперации(Результат);
		
		Если Результат.ЗаданиеВыполнено Тогда
			ЗавершеноПланированиеГрафикаВФоновомРежиме();
		Иначе
			НачатьОжиданиеФоновойОперации();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыФоновойОперации(Результат)
	
	АдресХранилищаФоноваяОперация = Результат.АдресХранилища;
	ИдентификаторЗадания = Результат.ИдентификаторЗадания;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьОжиданиеФоновойОперации()
	
	ПодключитьОбработчикОжиданияФоновойОперации();
	ОткрытьФормуДлительнойОперации();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияФоновойОперации()
	
	ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала = 1.2;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДлительнойОперации()
	
	ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтаФорма, ИдентификаторЗадания);
	
КонецПроцедуры 

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
 	
	Попытка
		
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ИдентификаторЗадания Тогда
			
			Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда
				
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
				
				Если ТекущаяФоноваяОперация = ИмяФоновойОперацииПланированиеГрафика() Тогда
					ЗавершеноПланированиеГрафикаВФоновомРежиме();
				ИначеЕсли ТекущаяФоноваяОперация = ИмяФоновойОперацииСохранениеГрафика() Тогда
					ЗавершеноСохранениеГрафикаВФоновомРежиме();
				ИначеЕсли ТекущаяФоноваяОперация = ИмяФоновойОперацииУдалениеРезультатов() Тогда
					ЗавершеноУдалениеРезультатовПланированияВФоновомРежиме();
				КонецЕсли;
								
			Иначе
				
				ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
				ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания",
					ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФоновойОперацииСохранениеГрафика()
	
	Возврат "СохранениеГрафика";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФоновойОперацииУдалениеРезультатов()
	
	Возврат "УдалениеРезультатов";
	
КонецФункции
&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции
//----------------------------------------------------------------------------
&НаСервере
Функция АдресТовары()
	
	Запрос = Новый Запрос();
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтрокиВДокументе,
		|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Значение(Справочник.Назначения.ПустаяСсылка) КАК Назначение,
		|	Товары.Упаковка КАК Упаковка,
		|	Товары.Количество КАК КЗаказу,
		|	Товары.Склад КАК Склад,
		|	Товары.Подразделение КАК Подразделение,
		|	Товары.ДатаОтгрузки КАК ДатаОтгрузки
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК Товары
		|ГДЕ
		|	Товары.НомерСтроки в (&мНомеровСтрок)  
		|	И Товары.Ссылка = &ДокументСсылка
		|ИНДЕКСИРОВАТЬ ПО
		|   Номенклатура
		|;
		|
		|///////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.НомерСтрокиВДокументе КАК НомерСтрокиВДокументе,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(СтавкиНДСНоменклатуры.СтавкаНДС, ЕСТЬNULL(ОсновныеСтавкиНДС.СтавкаНДС,
		|		ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка))) КАК СтавкаНДС,
		|	Товары.Назначение КАК Назначение,
		|	Товары.Упаковка КАК Упаковка,
		|	Товары.КЗаказу * ЕСТЬNULL(&ТекстЗапросаКоэффициентУпаковки, 1) КАК Количество,
		|	Товары.КЗаказу КАК КоличествоУпаковок,
		|	Товары.Склад КАК Склад,
		|	Товары.Подразделение КАК Подразделение,
		|	Товары.ДатаОтгрузки КАК ДатаОтгрузки,
		|	ВЫБОР КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа) ТОГДА
		|				Товары.Подразделение
		|			ИНАЧЕ
		|				Товары.Склад
		|		КОНЕЦ КАК Получатель,
		|	ВЫБОР КОГДА Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга) ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|		КОНЕЦ КАК СписатьНаРасходы
		|ИЗ
		|	Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиЕдиницыИзмерения КАК ВсеУпаковки
		|		ПО ВсеУпаковки.Ссылка = Товары.Упаковка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНДСНоменклатуры.СрезПоследних(&Период,
		|			Страна = &СтранаРегистрации ИЛИ Страна = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)) КАК СтавкиНДСНоменклатуры
		|		ПО СтавкиНДСНоменклатуры.Номенклатура = Товары.Номенклатура 
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСтавкиНДС.СрезПоследних(&Период, Страна = &СтранаРегистрации) КАК ОсновныеСтавкиНДС
		|		ПО ИСТИНА
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтрокиВДокументе
		|;
		|
		|////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА МИНИМУМ(Товары.Склад) = МАКСИМУМ(Товары.Склад)
		|			ТОГДА МИНИМУМ(Товары.Склад)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|	КОНЕЦ КАК ОдинСклад
		|ИЗ
		|	Товары КАК Товары
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(Товары.Склад) = ТИП(Справочник.Склады) И Товары.Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,
		"&ТекстЗапросаКоэффициентУпаковки",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаКоэффициентаУпаковки(
		"ВсеУпаковки.Ссылка",
		"Товары.Номенклатура"));
		
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Ссылка, "Дата, Организация");
	Запрос.УстановитьПараметр("мНомеровСтрок", ТаблицаТоваров.Выгрузить(, "НомерСтроки").ВыгрузитьКолонку("НомерСтроки"));
	Запрос.УстановитьПараметр("ДокументСсылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СтранаРегистрации", ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(ЗначенияРеквизитов.Организация));
	
	Результаты = Запрос.ВыполнитьПакет();
	тТоваров = Результаты[Результаты.ВГраница() - 1].Выгрузить();
	АдресТовары = ПоместитьВоВременноеХранилище(тТоваров);
	Выборка = Результаты[Результаты.ВГраница()].Выбрать();
	ОдинСклад = Справочники.Склады.ПустаяСсылка();
	Если Выборка.Следующий() Тогда
		ОдинСклад = Выборка.ОдинСклад;
	КонецЕсли;
	
	Возврат Новый Структура("АдресТовары,ОдинСклад", АдресТовары, ОдинСклад);
	
КонецФункции

&НаКлиенте
Процедура ВоеннаяПродукцияПриИзменении(Элемент)
	ОбнулитьДанныеПоСрокам(); 
КонецПроцедуры

//=====================================================================================================

&НаСервере
Функция ПланироватьГрафикВФоновомРежиме(НастройкиРасчета)
	
	ТекущаяФоноваяОперация = ИмяФоновойОперацииПланированиеГрафика();
	
	НаименованиеЗадания = НСтр("ru = 'Планирование графика производства заказа';
								|en = 'Production schedule planning for order'");
	
	ИмяПроцедуры = "ГрафикПроизводстваСтруктурыЗаказа.РассчитатьРабочийГрафикИМодель";
	
	РезультатРасчета = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		ИмяПроцедуры,
		НастройкиРасчета,
		НаименованиеЗадания);
	
	Возврат РезультатРасчета;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяФоновойОперацииПланированиеГрафика()
	
	Возврат "ПланированиеГрафика";
	
КонецФункции
 
&НаКлиенте
Процедура НачатьОжиданиеДлительныхОпераций()
	
	Для каждого Строка Из ДлительныеОперацииФормы Цикл
		
		Если Строка.НачатьОжидание Тогда
			
			ОповещениеОЗавершении = ОповещениеОЗавершенииДлительнойОперации(Строка.Имя);
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
			
			ДлительныеОперацииКлиент.ОжидатьЗавершение(
				Строка.ДлительнаяОперация,
				ОповещениеОЗавершении,
				ПараметрыОжидания);
			
			ОтобразитьНачалоОжиданияДлительнойОперации(Строка.Имя);
			
			Строка.НачатьОжидание = Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Функция ОповещениеОЗавершенииДлительнойОперации(Имя)
	
	Если Имя = ИмяДлительнойОперацииСрокиВыпуска() Тогда
		
		Результат = Новый ОписаниеОповещения("ПрочитатьСрокиВыпускаПродукцииВФонеЗавершение", ЭтотОбъект);
		
	ИначеЕсли Имя = ИмяДлительнойОперацииЗагрузкаОборудования() Тогда
		
		Результат = Новый ОписаниеОповещения("ЗаполнитьДиаграммуЗагрузкаОборудованияВФонеЗавершение", ЭтотОбъект);
		
	ИначеЕсли Имя = ИмяДлительнойОперацииОбеспечениеМатериалами() Тогда
		
		Результат = Новый ОписаниеОповещения("ЗаполнитьДиаграммуОбеспечениеМатериаламиВФонеЗавершение", ЭтотОбъект);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтобразитьНачалоОжиданияДлительнойОперации(Имя)
	
	Если Имя = ИмяДлительнойОперацииСрокиВыпуска() Тогда
		
		Элементы.ГруппаПродукцияДлительнаяОперация.ТекущаяСтраница = Элементы.СтраницаПродукцияДлительнаяОперация;
		
	ИначеЕсли Имя = ИмяДлительнойОперацииЗагрузкаОборудования() Тогда
		
		Элементы.ГруппаЗагрузкаОборудованияДлительнаяОперация.ТекущаяСтраница =
			Элементы.СтраницаЗагрузкаОборудованияДлительнаяОперация;
	
	ИначеЕсли Имя = ИмяДлительнойОперацииОбеспечениеМатериалами() Тогда
		
		Элементы.ГруппаОбеспечениеМатериаламиДлительнаяОперация.ТекущаяСтраница =
			Элементы.СтраницаОбеспечениеМатериаламиДлительнаяОперация;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Функция ИмяДлительнойОперацииСрокиВыпуска()
	
	Возврат "ЧтениеСроковВыпускаПродукции";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяДлительнойОперацииЗагрузкаОборудования()
	
	Возврат "ЧтениеЗагрузкиОборудования";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяДлительнойОперацииОбеспечениеМатериалами()
	
	Возврат "ЧтениеОбеспеченияМатериалами";
	
КонецФункции



&НаКлиенте
Процедура ЗавершеноПланированиеГрафикаВФоновомРежиме()
	
	Если ЭтоАдресВременногоХранилища(АдресХранилищаФоноваяОперация) Тогда
		
		ОчиститьСообщения();
		ПрочитатьРезультатыПланирования();
		НачатьОжиданиеДлительныхОпераций();
		
		//Если ГрафикЗапланирован Тогда
		//	//Оповестить("Запись_ГрафикПроизводства", ЗаказНаПроизводство);
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРезультатыПланирования()
	
	Результат = ПолучитьИзВременногоХранилища(АдресХранилищаФоноваяОперация);
	
	ЗаполнитьЗначенияСвойств(
		ЭтотОбъект,
		Результат,
		"ГрафикЗапланирован, МодельЗапланирована, НомерЗаданияКРасчетуГрафикаПроизводства, ОтменитьРучныеИзмененияГрафика");
	РазмещенныеЭтапы.ЗагрузитьЗначения(Результат.РазмещенныеЭтапы);
	
	ЗначениеВРеквизитФормы(Результат.Ошибки, "Ошибки");
	СообщитьОбОшибкахПриПланировании();
	
	ПоказатьОповещения(Результат.Оповещения);
	
	ОбновитьДанныеГрафика();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеГрафика()
	
	ПрочитатьСрокиГрафика();
	
	ПрочитатьСрокиВыпускаПродукцииВФоне();
	
	УстановитьПараметрыСпискаЭтапы();
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьДлительнуюОперацию(Имя)
	
	ОписаниеОперации = ОписаниеДлительнойОперации(ЭтотОбъект, Имя);
	
	Если НЕ ОписаниеОперации.ДлительнаяОперация = Неопределено Тогда
		
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ОписаниеОперации.ДлительнаяОперация.ИдентификаторЗадания);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ОписаниеДлительнойОперации(Форма, Имя)
	
	СтруктураПоиска = Новый Структура("Имя", Имя);
	НайденныеСтроки = Форма.ДлительныеОперацииФормы.НайтиСтроки(СтруктураПоиска);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Результат = Неопределено;
	Иначе
		Результат = НайденныеСтроки[0];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПрочитатьСрокиВыпускаПродукцииВФоне()
	
	ИмяОперации = ИмяДлительнойОперацииСрокиВыпуска();
	ОтменитьДлительнуюОперацию(ИмяОперации);
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Распоряжение", ЗаказНаПроизводство);
	ПараметрыПроцедуры.Вставить("ГрафикЗапланирован", ГрафикЗапланирован);
	ПараметрыПроцедуры.Вставить("МодельЗапланирована", МодельЗапланирована);
	ПараметрыПроцедуры.Вставить("ДинамическаяСтруктура", ДинамическаяСтруктура);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Чтение сроков выпуска продукции';
															|en = 'Read product release time'");
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ПланированиеГрафикаПроизводства2_2.ПрочитатьСрокиВыпускаПродукции",
		ПараметрыПроцедуры,
		ПараметрыВыполнения);
	
	ОписаниеОперации = ОписаниеДлительнойОперации(ЭтотОбъект, ИмяОперации);
	Если ДлительнаяОперация.Статус = СтатусДлительнойОперацииВыполняется() Тогда
		
		ОписаниеОперации.ДлительнаяОперация = ДлительнаяОперация;
		ОписаниеОперации.НачатьОжидание = Истина;
		
	Иначе
		
		ОписаниеОперации.ДлительнаяОперация = Неопределено;
		ОписаниеОперации.НачатьОжидание = Ложь;
		
		ОбработатьРезультатЧтенияСроковВыпускаПродукцииВФоне(ДлительнаяОперация);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСрокиВыпускаПродукции(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Если ТипЗнч(Результат) = Тип("ТаблицаЗначений") Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	бит_СрокиИзготовленияВПиРиски.Номенклатура КАК Номенклатура,
		|	бит_СрокиИзготовленияВПиРиски.РискУвеличенияСрокаДни КАК Риск
		|ИЗ
		|	РегистрСведений.бит_СрокиИзготовленияВПиРиски КАК бит_СрокиИзготовленияВПиРиски
		|ГДЕ
		|	бит_СрокиИзготовленияВПиРиски.Номенклатура В (&мНоменклатура)
		|	И Не бит_СрокиИзготовленияВПиРиски.ВоеннаяПродукция
		|");
		Запрос.УстановитьПараметр("мНоменклатура", ТаблицаТоваров.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура"));
		тРиски = Запрос.Выполнить().Выгрузить();
		
		Продукция.Загрузить(Результат);     
		сч = 0;
		Для каждого Строка Из Продукция Цикл
			
			Если ЗначениеЗаполнено(Строка.ДатаВыпускаГрафик) Тогда  
				
				СтрокаПоКлючу = тРиски.Найти(Строка.Номенклатура, "Номенклатура");
				Если СтрокаПоКлючу <> Неопределено Тогда
					Риск = СтрокаПоКлючу.Риск;
				Иначе
					Риск = 0;
				КонецЕсли;
				
				ТаблицаТоваров[сч].СрокИзготовления = Строка.ДатаВыпускаГрафик + Риск * 86400;
			КонецЕсли;
			
			сч = сч + 1;
			
		КонецЦикла;
	КонецЕсли;   
	
	РассчитатьОбщийСрокИзготовления();  
	Элементы.Ошибки.Видимость = Ошибки.Количество();    
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтатусДлительнойОперацииВыполнено()
	
	Возврат "Выполнено";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СтатусДлительнойОперацииОшибка()
	
	Возврат "Ошибка";
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОчиститьИПоказатьСрокиВыпускаПродукции(Форма)
	
	Форма.Продукция.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатЧтенияСроковВыпускаПродукцииВФоне(Результат)
	
	Если Результат.Статус = СтатусДлительнойОперацииВыполнено() Тогда
		
		ЗагрузитьСрокиВыпускаПродукции(Результат.АдресРезультата);
		
	Иначе
		
		ОчиститьИПоказатьСрокиВыпускаПродукции(ЭтотОбъект);
		
		Если Результат.Статус = СтатусДлительнойОперацииОшибка() Тогда
			
			ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СтатусДлительнойОперацииВыполняется()
	
	Возврат "Выполняется";
	
КонецФункции

&НаСервереБезКонтекста
Функция СтатусРабочийГрафик()
	
	Возврат РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусРабочийГрафик();
	
КонецФункции

&НаСервереБезКонтекста
Функция СтатусПредварительныйГрафик()
	
	Возврат РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусПредварительныйГрафик();
	
КонецФункции
	
&НаСервереБезКонтекста
Функция СтатусМодельГрафика()
	
	Возврат РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусМодельГрафика();
	
КонецФункции

&НаСервере
Процедура ПрочитатьСрокиГрафика()
	
	СтатусРабочийГрафик = СтатусРабочийГрафик();
	СтатусПредварительныйГрафик = СтатусПредварительныйГрафик();
	СтатусМодель = СтатусМодельГрафика();
	
	СтатусыГрафика = Новый Массив;
	Если ГрафикЗапланирован И НЕ ДинамическаяСтруктура Тогда
		СтатусыГрафика.Добавить(СтатусПредварительныйГрафик);
	Иначе
		СтатусыГрафика.Добавить(СтатусРабочийГрафик);
	КонецЕсли;
	Если МодельЗапланирована Тогда
		СтатусыГрафика.Добавить(СтатусМодель);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ГрафикЭтаповПроизводства2_2.Этап КАК Этап
	|ПОМЕСТИТЬ ВТРазмещенныеЭтапы
	|ИЗ
	|	РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикЭтаповПроизводства2_2
	|ГДЕ
	|	ГрафикЭтаповПроизводства2_2.ЗаказНаПроизводство = &ЗаказНаПроизводство
	|	И ГрафикЭтаповПроизводства2_2.СтатусГрафика <> &СтатусРабочийГрафик
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Этап
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ГрафикЭтаповПроизводства2_2.Начало) КАК ДатаЗапуска
	|ИЗ
	|	РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикЭтаповПроизводства2_2
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмещенныеЭтапы КАК ВТРазмещенныеЭтапы
	|		ПО ГрафикЭтаповПроизводства2_2.Этап = ВТРазмещенныеЭтапы.Этап
	|ГДЕ
	|	ГрафикЭтаповПроизводства2_2.ЗаказНаПроизводство = &ЗаказНаПроизводство
	|	И ГрафикЭтаповПроизводства2_2.СтатусГрафика = &СтатусРабочийГрафик
	|	И ВТРазмещенныеЭтапы.Этап ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГрафикЭтаповПроизводства2_2.СтатусГрафика,
	|	МИНИМУМ(ГрафикЭтаповПроизводства2_2.Начало) КАК ДатаЗапуска,
	|	МАКСИМУМ(ГрафикЭтаповПроизводства2_2.Окончание) КАК ДатаВыпуска
	|ИЗ
	|	РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикЭтаповПроизводства2_2
	|ГДЕ
	|	ГрафикЭтаповПроизводства2_2.ЗаказНаПроизводство = &ЗаказНаПроизводство
	|	И ГрафикЭтаповПроизводства2_2.СтатусГрафика В(&СтатусыГрафика)
	|
	|СГРУППИРОВАТЬ ПО
	|	ГрафикЭтаповПроизводства2_2.СтатусГрафика");
	
	Запрос.УстановитьПараметр("ЗаказНаПроизводство", ЗаказНаПроизводство);
	Запрос.УстановитьПараметр("СтатусыГрафика", СтатусыГрафика);
	Запрос.УстановитьПараметр("СтатусРабочийГрафик", СтатусРабочийГрафик);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[1].Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.ДатаЗапуска) Тогда
		ДатаЗапускаРабочийГрафик = Выборка.ДатаЗапуска;
	Иначе
		ДатаЗапускаРабочийГрафик = Неопределено;
	КонецЕсли;
	
	Выборка = МассивРезультатов[2].Выбрать();
	
	СрокиГрафикаЗаполнены = Ложь;
	СрокиМоделиЗаполнены = Ложь;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СтатусГрафика = СтатусПредварительныйГрафик
			ИЛИ Выборка.СтатусГрафика = СтатусРабочийГрафик Тогда
			
			ДатаЗапускаГрафик = Выборка.ДатаЗапуска;
			ДатаВыпускаГрафик = Выборка.ДатаВыпуска;
			СрокиГрафикаЗаполнены = Истина;
			
		ИначеЕсли Выборка.СтатусГрафика = СтатусМодель Тогда
			
			ДатаЗапускаМодель = Выборка.ДатаЗапуска;
			ДатаВыпускаМодель = Выборка.ДатаВыпуска;
			СрокиМоделиЗаполнены = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДатаЗапускаРабочийГрафик) Тогда
		
		Если ЗначениеЗаполнено(ДатаЗапускаГрафик) Тогда
			ДатаЗапускаГрафик = Мин(ДатаЗапускаГрафик, ДатаЗапускаРабочийГрафик);
		КонецЕсли;
		Если ЗначениеЗаполнено(ДатаЗапускаМодель) Тогда
			ДатаЗапускаМодель = Мин(ДатаЗапускаМодель, ДатаЗапускаРабочийГрафик);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СрокиГрафикаЗаполнены Тогда
		
		Если ЗначениеЗаполнено(ДатаПотребности) Тогда
			ОпозданиеГрафик = РазностьДатСтрокой(ДатаПотребности, ДатаВыпускаГрафик);
		Иначе
			ОпозданиеГрафик = "";
		КонецЕсли;
		
		ДлительностьГрафик = РазностьДатСтрокой(ДатаЗапускаГрафик, ДатаВыпускаГрафик);
		
	Иначе
		ДатаЗапускаГрафик = '00010101';
		ДатаВыпускаГрафик = '00010101';
		ОпозданиеГрафик = "";
		ДлительностьГрафик = "";
	КонецЕсли;
	
	Если СрокиМоделиЗаполнены Тогда
		
		Если ЗначениеЗаполнено(ДатаПотребности) Тогда
			ОпозданиеМодель = РазностьДатСтрокой(ДатаПотребности, ДатаВыпускаМодель);
		Иначе
			ОпозданиеМодель = "";
		КонецЕсли;
		
		ДлительностьМодель = РазностьДатСтрокой(ДатаЗапускаМодель, ДатаВыпускаМодель);
	Иначе
		ДатаЗапускаМодель = '00010101';
		ДатаВыпускаМодель = '00010101';
		ОпозданиеМодель = "";
		ДлительностьМодель = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РазностьДатСтрокой(Знач Дата1, Знач Дата2)
	
	РазностьЧасы = Цел((Дата2 - Дата1 + 1)/3600);
	
	Если РазностьЧасы < 1 Тогда
		
		Результат = "";
		
	Иначе
		
		Если РазностьЧасы <= 48 Тогда
			
			Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 ч.';
					|en = '%1 h.'"),
				РазностьЧасы);
			
		Иначе
			
			РазностьДни = Цел((НачалоДня(Дата2 + 1) - НачалоДня(Дата1))/86400);
			
			Результат = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 дн.';
					|en = '%1 days'"),
				Формат(РазностьДни, "ЧГ=0"));
				
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


&НаКлиентеНаСервереБезКонтекста
Функция СтатусГрафикаСписокЭтапы(Форма)
	
	Если Форма.ГрафикЗапланирован И НЕ Форма.ДинамическаяСтруктура Тогда
		Результат = СтатусПредварительныйГрафик();
	Иначе
		Результат = СтатусРабочийГрафик();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыСпискаЭтапы()
	
	СтатусГрафика = СтатусГрафикаСписокЭтапы(ЭтотОбъект);
	
	Этапы.Параметры.УстановитьЗначениеПараметра("Распоряжение", ЗаказНаПроизводство);
	Этапы.Параметры.УстановитьЗначениеПараметра("СтатусГрафика", СтатусГрафика);
	
	ЭтапыДинамические.Параметры.УстановитьЗначениеПараметра("Распоряжение", ЗаказНаПроизводство);
	ЭтапыДинамические.Параметры.УстановитьЗначениеПараметра("СтатусГрафика", СтатусГрафика);
	
	СтатусыЭтапа = Новый Массив;
	СтатусыЭтапа.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Формируется);
	СтатусыЭтапа.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.Сформирован);
	СтатусыЭтапа.Добавить(Перечисления.СтатусыЭтаповПроизводства2_2.КВыполнению);
	Этапы.Параметры.УстановитьЗначениеПараметра("СтатусыЭтапа", СтатусыЭтапа);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьОповещения(Оповещения)
	
	Если ТипЗнч(Оповещения) = Тип("Массив") Тогда
		Для каждого Оповещение Из Оповещения Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Оповещение);
		КонецЦикла;
	ИначеЕсли ТипЗнч(Оповещения) = Тип("Соответствие") Тогда
		Для каждого КлючИЗначение Из Оповещения Цикл
			ОбщегоНазначения.СообщитьПользователю(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СообщитьОбОшибкахПриПланировании()
	
	Если Ошибки.Количество() > 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'При планировании графика возникли ошибки.';
				|en = 'Errors occurred when planning the schedule.'"),
			,
			"Ошибки");
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершеноСохранениеГрафикаВФоновомРежиме()
	
	//Оповестить("Запись_ГрафикПроизводства", ЗаказНаПроизводство);
	
	Если СохранениеПередЗакрытием Тогда
		
		Закрыть();
		
	Иначе
		
		ОбновитьДанныеГрафика();
		НачатьОжиданиеДлительныхОпераций();
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ЗавершеноУдалениеРезультатовПланированияВФоновомРежиме()
	
	 ОчиститьРезультатыПланирования();
	
	Если УдалениеРезультатовПередЗакрытием Тогда
		
		Закрыть();
		
	Иначе
		
		Если ПеречитываниеДанных Тогда
			ПеречитатьДанныеНаСервере();
		Иначе
			ОбновитьДанныеГрафика();
		КонецЕсли;
		НачатьОжиданиеДлительныхОпераций();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРезультатыПланирования()
	
	ГрафикЗапланирован = Ложь;
	МодельЗапланирована = Ложь;
	НомерЗаданияКРасчетуГрафикаПроизводства = 0;
	ОтменитьРучныеИзмененияГрафика = Ложь;
	Ошибки.Очистить();
	РазмещенныеЭтапы.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьДанныеНаСервере()
	
	Ошибки.Очистить();
	
	ПрочитатьДанныеРаспоряжения();
	ОбновитьДанныеГрафика();   
	
	ПеречитываниеДанных = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеРаспоряжения()
	
	Если ЗаказНаПроизводство.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Заказ.Дата КАК Дата,
		|	Заказ.Номер КАК Номер,
		|	Заказ.ТипПроизводственногоПроцесса КАК ТипПроизводственногоПроцесса,
		|	Заказ.ДинамическаяСтруктура КАК ДинамическаяСтруктура,
		|	Заказ.НачатьНеРанее КАК НачатьНеРанее
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2 КАК Заказ
		|ГДЕ
		|	Заказ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(Продукция.ДатаПотребности) КАК ДатаПотребности
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2.Продукция КАК Продукция
		|ГДЕ
		|	Продукция.Ссылка = &Ссылка
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(Продукция.Ссылка) > 0");
	Запрос.УстановитьПараметр("Ссылка", ЗаказНаПроизводство);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеРаспоряжения = РезультатыЗапроса[0].Выбрать();
	ДанныеРаспоряжения.Следующий();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеРаспоряжения, "НачатьНеРанее");
	
	ДанныеТабличнойЧасти = РезультатыЗапроса[1].Выбрать();
	Если ДанныеТабличнойЧасти.Следующий() Тогда
		ДатаПотребности = ДанныеТабличнойЧасти.ДатаПотребности;
	Иначе
		ДатаПотребности = '00010101';
	КонецЕсли;
	
	ЭтоРазборка = (ДанныеРаспоряжения.ТипПроизводственногоПроцесса = Перечисления.ТипыПроизводственныхПроцессов.Разборка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(ЗаказНаПроизводство) Тогда
		УдалитьЗаказНаПроизводство();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтгрузкиПриИзменении(Элемент)
	
	Если РасчетЗавершен И ВариантОтгрузки = 1 Тогда 
		Для каждого стр из ТаблицаТоваров Цикл
			стр.СрокИзготовления = СрокИзготовленияЗаказа;
		КонецЦикла; 
	Иначе
		ОбнулитьДанныеПоСрокам();
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбнулитьДанныеПоСрокам() 
	
	Для каждого стр из ТаблицаТоваров Цикл
		стр.СрокИзготовления = ПустойСрок();
	КонецЦикла;
	СрокИзготовленияЗаказа = Дата("00010101");
	
КонецПроцедуры
